opensoap/contrib/cpplib/samples/hello.xml

<?xml version="1.0" encoding="EUC-JP"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <Hello xmlns="http://opensoap.jp/samples/hello">
      <name>dora</name>
    </Hello>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
